In [60]:
import pandas as pd

In [61]:
people = {
    "first": ["Akshay", "Sahaj", "Darshit"],
    "last": ["Savaliya", "Patel", "Patel"],
    "email": ["akshaysavaliya@gmail.com", "sahajpatel@gmail.com", "darshitpatel@gmail.com"]
}

In [62]:
df = pd.DataFrame(people)
df

     first      last                     email
0   Akshay  Savaliya  akshaysavaliya@gmail.com
1    Sahaj     Patel      sahajpatel@gmail.com
2  Darshit     Patel    darshitpatel@gmail.com

In [63]:
df['first']+' '+df['last']

0    Akshay Savaliya
1        Sahaj Patel
2      Darshit Patel
dtype: object

In [64]:
# Lets create a column
# if column already present than update the values

df['full_name'] = df['first']+' '+df['last']
df

     first      last                     email        full_name
0   Akshay  Savaliya  akshaysavaliya@gmail.com  Akshay Savaliya
1    Sahaj     Patel      sahajpatel@gmail.com      Sahaj Patel
2  Darshit     Patel    darshitpatel@gmail.com    Darshit Patel

In [65]:
# Lets remove a column
df.drop(columns=['first', 'last'])
# still not delete

                      email        full_name
0  akshaysavaliya@gmail.com  Akshay Savaliya
1      sahajpatel@gmail.com      Sahaj Patel
2    darshitpatel@gmail.com    Darshit Patel

In [66]:
df

     first      last                     email        full_name
0   Akshay  Savaliya  akshaysavaliya@gmail.com  Akshay Savaliya
1    Sahaj     Patel      sahajpatel@gmail.com      Sahaj Patel
2  Darshit     Patel    darshitpatel@gmail.com    Darshit Patel

In [67]:
df.drop(columns=['first', 'last'], inplace=True)
df

                      email        full_name
0  akshaysavaliya@gmail.com  Akshay Savaliya
1      sahajpatel@gmail.com      Sahaj Patel
2    darshitpatel@gmail.com    Darshit Patel

In [68]:
# Lets split the full name
df['full_name'].str.split(' ')

0    [Akshay, Savaliya]
1        [Sahaj, Patel]
2      [Darshit, Patel]
Name: full_name, dtype: object

In [69]:
df['full_name'].str.split(' ', expand=True)

         0         1
0   Akshay  Savaliya
1    Sahaj     Patel
2  Darshit     Patel

In [70]:
# Lets assign this data frame columns in our dataframe
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

                      email        full_name    first      last
0  akshaysavaliya@gmail.com  Akshay Savaliya   Akshay  Savaliya
1      sahajpatel@gmail.com      Sahaj Patel    Sahaj     Patel
2    darshitpatel@gmail.com    Darshit Patel  Darshit     Patel

### Adding Rows:

In [71]:
df = df.append({'first': 'Meet'}, ignore_index=True)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_12704\684574851.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'first': 'Meet'}, ignore_index=True)

                      email        full_name    first      last
0  akshaysavaliya@gmail.com  Akshay Savaliya   Akshay  Savaliya
1      sahajpatel@gmail.com      Sahaj Patel    Sahaj     Patel
2    darshitpatel@gmail.com    Darshit Patel  Darshit     Patel
3                       NaN              NaN     Meet       NaN

In [72]:
# Deleting a row
df.drop(index=3, inplace=True)
df

                      email        full_name    first      last
0  akshaysavaliya@gmail.com  Akshay Savaliya   Akshay  Savaliya
1      sahajpatel@gmail.com      Sahaj Patel    Sahaj     Patel
2    darshitpatel@gmail.com    Darshit Patel  Darshit     Patel